# Import

## Imports des librairies

In [16]:
import pandas as pd
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt

## Imports des données

In [36]:
df = pd.read_csv("ds_salaries.csv")

In [25]:
df.shape

(607, 12)

# EDA Tristan

## Jointures

On procède à deux jointures pour clarifier le dataset, à savoir les colonnes salary_currency et emplyee_residence et company_location pour avoir les noms en toutes lettres et non en code

In [18]:
df_pays = pd.read_csv('pays.csv')

In [19]:
df_monnaie = pd.read_csv('codes_salaires.csv')

In [39]:
df_pays.head()

             Name Code
0     Afghanistan   AF
1   Åland Islands   AX
2         Albania   AL
3         Algeria   DZ
4  American Samoa   AS

In [34]:
df_monnaie=df_monnaie.drop(['Entity','NumericCode','MinorUnit','WithdrawalDate'],axis=1)

In [40]:
df_monnaie.head()

         Currency AlphabeticCode
0         Afghani            AFN
1            Euro            EUR
2             Lek            ALL
3  Algerian Dinar            DZD
4       US Dollar            USD

In [37]:
df = df.merge(df_pays, how='inner', left_on='company_location', right_on='Code').drop(['Code','company_location'], axis=1).rename(columns={'Name': 'Company_location'})
df = df.merge(df_pays, how='inner', left_on='employee_residence', right_on='Code').drop(['Code','employee_residence'], axis=1).rename(columns={'Name': 'employee_residence'})
df = df.merge(df_monnaie, how='inner', left_on='salary_currency', right_on='AlphabeticCode').drop(['AlphabeticCode','salary_currency'], axis=1).rename(columns={'Currency': 'salary_currency'})

In [38]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_in_usd,remote_ratio,company_size,Company_location,employee_residence,salary_currency
0,0,2020,MI,FT,Data Scientist,70000,79833,0,L,Germany,Germany,Euro
1,0,2020,MI,FT,Data Scientist,70000,79833,0,L,Germany,Germany,Euro
2,0,2020,MI,FT,Data Scientist,70000,79833,0,L,Germany,Germany,Euro
3,0,2020,MI,FT,Data Scientist,70000,79833,0,L,Germany,Germany,Euro
4,0,2020,MI,FT,Data Scientist,70000,79833,0,L,Germany,Germany,Euro
...,...,...,...,...,...,...,...,...,...,...,...,...
11272,505,2022,EN,FT,Data Scientist,120000,86703,50,M,Australia,Australia,Australian Dollar
11273,505,2022,EN,FT,Data Scientist,120000,86703,50,M,Australia,Australia,Australian Dollar
11274,505,2022,EN,FT,Data Scientist,120000,86703,50,M,Australia,Australia,Australian Dollar
11275,505,2022,EN,FT,Data Scientist,120000,86703,50,M,Australia,Australia,Australian Dollar
11276,505,2022,EN,FT,Data Scientist,120000,86703,50,M,Australia,Australia,Australian Dollar

# EDA Camille

# EDA Selmane